## 판다스 라이브러리 임포트

In [2]:
#type below
import pandas as pd

## 판다스 자료구조
### 시리즈(Series)

In [3]:
data = ['2017','2018','2019','2020','2021']

In [5]:
#시리즈 생성하고 result에 저장
result = pd.Series(data)

In [12]:
print(result)

0    2017
1    2018
2    2019
3    2020
4    2021
dtype: object

### DataFrame 생성 예시 -1

In [9]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
        'score':[100, 95, 90, 85],
        'grade':['A', 'A', 'B', 'B']}
# python의 딕셔너리 구조 pandas에서 DataFrame으로 바로 적용 가능
# key 값이 column으로, value 값이 해당하는 column에 서로 다른 row로 삽입
# 분석에 사용되는 대부분의 데이터는 딕셔너리 형태로 제공(json 등)

In [10]:
# 데이터프레임 df를 생성하고 출력하세요
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     90     B
3   Choi     85     B

In [15]:
#df의 컬럼명을 조회하려면? 
df.columns

Index(['name', 'score', 'grade'], dtype='object')

In [16]:
#df의 데이터값 출력 (.columns에 비해 쓸 일이 많지는 않음)
df.values
# 참고) array는 numpy에서 쓰는 명칭

array([['Lee', 100, 'A'],
       ['Hwang', 95, 'A'],
       ['Kim', 90, 'B'],
       ['Choi', 85, 'B']], dtype=object)

In [17]:
# data type확인
df.dtypes

name     object
score     int64
grade    object
dtype: object

### DataFrame 생성 예시 -2

In [2]:
import pandas as pd

KTX_data = {'경부선KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선KTX': [300, 350, 450, 560, 1300, 2395, 3786]}
col_list = ['경부선KTX','호남선KTX','경전선KTX','전라선KTX','동해선KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

In [3]:
#df_KTX으로 데이터프레임(df_KTX)으로 생성하고 컬럼명은 col_list, 인덱스는 index_list 로 생성
df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX
2011   39060    7313    3627     309     300
2012   39896    6967    4168    1771     350
2013   42005    6873    4088    1954     450
2014   43621    6626    4424    2244     560
2015   41702    8675    4606    3146    1300
2016   41266   10622    4984    3945    2395
2017   32427    9228    5570    5766    3786

In [5]:
#df_KTX 컬럼명 조회
df_KTX.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX'], dtype='object')

### 데이터프레임 데이터 조회

In [7]:
#경부선KTX 컬럼 조회
df_KTX['경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

In [8]:
#경부선KTX, 호남선KTX 컬럼 조회
df_KTX[['경부선KTX', '호남선KTX']]
# 두 개 이상의 column을 선택할 때는 대괄호 두 개 사용

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

In [9]:
# 행기준 조회, 2012~2015년도
df_KTX[1:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX
2012   39896    6967    4168    1771     350
2013   42005    6873    4088    1954     450
2014   43621    6626    4424    2244     560
2015   41702    8675    4606    3146    1300

In [10]:
#행기준 조회, 2012~2015년도
df_KTX['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX
2012   39896    6967    4168    1771     350
2013   42005    6873    4088    1954     450
2014   43621    6626    4424    2244     560
2015   41702    8675    4606    3146    1300

### loc를 이용한 조회

In [11]:
#loc 사용, 컬럼이 '경부선KTX' 의 모든행
# df_KTX.loc[:, '경부선KTX']
df_KTX.loc[:, ['경부선KTX']]
# column을 하나만 선택하더라도 대괄호를 사용해주면 DataFrame 형태로 출력 가능
# 대괄호를 사용하지 않으면 Series 형태로 출력

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

In [12]:
#2011년데이터만 선택, loc사용
# df_KTX.loc[['2011'], :]
df_KTX.loc[['2011']] # Series가 아닌 DataFrame 형태로 출력하기 위해 대괄호 사용
# , 뒤를 생략하면 모든 column 선택 가능 (, : 형태와 같은 의미)

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX
2011   39060    7313    3627     309     300

In [13]:
#2013~2016년 행데이터 선택
df_KTX.loc['2013':'2016']
# 슬라이싱의 경우 대괄호를 사용하지 않아도 DataFrame 형태로 반환

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX
2013   42005    6873    4088    1954     450
2014   43621    6626    4424    2244     560
2015   41702    8675    4606    3146    1300
2016   41266   10622    4984    3945    2395

In [14]:
#2012~2014년까지 경부선 KTX 컬럼만 조회
# df_KTX['경부선KTX']['2012':'2014'] # column과 row 데이터를 따로 추출 가능
df_KTX.loc['2012':'2014', ['경부선KTX']] # 웬만하면 한 번에 추출하기

      경부선KTX
2012   39896
2013   42005
2014   43621

In [15]:
#2015~2017년까지 경부선KTX, 호남선KTX, 동해선KTX 컬럼 조회
df_KTX.loc['2015':'2017', ['경부선KTX', '호남선KTX', '동해선KTX']]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

In [16]:
#경부선등급 컬럼추가
def func(x):
    #return 'A' if x > 40000 else 'B' if x > 35000  else 'C' 
    if x > 40000:
        return 'A'
    elif x > 35000:
        return 'B'
    else:
        return 'C'
    
df_KTX['경부선등급'] = df_KTX['경부선KTX'].apply(lambda x: func(x))
# .apply(): 괄호 안의 내용을 모두 적용하라는 의미
# 경부선KTX column에 func(x)를 적용하여 경부선등급 column에 할당

In [17]:
df_KTX

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

### isin을 활용한 조회

In [19]:
#isin 사용. 경부선등급 = ['B','C']인 데이터 조회
df_KTX['경부선등급'].isin(['B', 'C'])
# 위 코드는 조건에 해당하는지 여부를 True, False로 반환

2011     True
2012     True
2013    False
2014    False
2015    False
2016    False
2017     True
Name: 경부선등급, dtype: bool

In [20]:
#isin 사용. 경부선등급 = ['B','C']인 데이터 조회
df_KTX[df_KTX['경부선등급'].isin(['B', 'C'])]
# True, False 반환 코드에 전체 DataFrame을 한 번 더 씌워주면 조건이 True인 데이터 반환

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [21]:
#위조건('경부선등급'].isin(['B','C'])을 만족하는 경부선KTX 만 조회
df_KTX.loc[df_KTX['경부선등급'].isin(['B', 'C'])]
# 지금은 차이가 없지만, 데이터의 크기가 커지면 loc를 사용하는 것이 효율적
# ,를 사용하면 , 앞의 조건이 row, 뒤의 조건이 column에 접근
# ,를 사용하지 않으면 row, column에 동시 접근

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

## 데이터프레임에서 NaN 값 다루기

In [22]:
import pandas as pd
import numpy as np # 수치 연산을 위한 라이브러리: 데이터분석보다 딥러닝에서 많이 사용

# np.arange(18): 0부터 17까지의 숫자 생성
# np.reshape(6, 3): 벡터 형태의 0~17을 6행 3열의 2차원 구조로 변환
df = pd.DataFrame(np.arange(18).reshape(6,3),
                               index=['a','b','c','d','e','f'],
                               columns=['x','y','z'])


df

    x   y   z
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14
f  15  16  17

In [23]:
df['data1'] = pd.Series([1.7, 1.2, 2.4], index=['a', 'e', 'c'])
df['data2'] = np.nan # null 값을 삽입
df

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
b   3   4   5    NaN    NaN
c   6   7   8    2.4    NaN
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

### NaN 인 데이터 찾기

In [24]:
#DataFrame내 NaN 데이터를 찾아 True/False 반환
df.isnull()
# 마찬가지로 조건에 해당, True 혹은 False로 반환

       x      y      z  data1  data2
a  False  False  False  False   True
b  False  False  False   True   True
c  False  False  False  False   True
d  False  False  False   True   True
e  False  False  False  False   True
f  False  False  False   True   True

In [25]:
#DataFrame내 NaN 데이터를 찾아 True/False 반환
df.isna()
# .isnull(), .isna()는 같은 결과를 반환하므로 둘 중 어느 것을 사용해도 무방

       x      y      z  data1  data2
a  False  False  False  False   True
b  False  False  False   True   True
c  False  False  False  False   True
d  False  False  False   True   True
e  False  False  False  False   True
f  False  False  False   True   True

### NaN 값만 추출하기

In [27]:
#data1 컬럼의 결측치를 True/False로 반환
df['data1'].isnull()

a    False
b     True
c    False
d     True
e    False
f     True
Name: data1, dtype: bool

In [28]:
#data1에서 NaN인 데이터 조회
df.loc[df['data1'].isnull()]

    x   y   z  data1  data2
b   3   4   5    NaN    NaN
d   9  10  11    NaN    NaN
f  15  16  17    NaN    NaN

In [29]:
df[df['data1'].isna()] # .isnull()을 사용했을 때와 동일한 결과

    x   y   z  data1  data2
b   3   4   5    NaN    NaN
d   9  10  11    NaN    NaN
f  15  16  17    NaN    NaN

In [38]:
#loc로 조회, data1의 값이 Nan인 x컬럼조회
# loc 사용 시 , 앞의 부분은 row 지정, 뒤의 부분은 column 지정
# df.loc[df['data1'].isnull(), 'x'] # Series 형태
df.loc[df['data1'].isnull(), ['x']] # DataFrame 형태

    x
b   3
d   9
f  15

In [33]:
# data1의 값이 Nan인 x컬럼조회
# df[df['data1'].isnull()]['x'] # Series 형태
df[df['data1'].isnull()][['x']] # DataFrame 형태
# loc를 사용하면 row, column에 한 번에 접근 가능, 사용하지 않으면 두 번에 걸쳐 접근

    x
b   3
d   9
f  15

In [39]:
#loc로 조회, data1의 값이 Nan인 x:z 컬럼조회
df.loc[df['data1'].isnull(), 'x':'z']
# 슬라이싱 사용 시 대괄호 한 번 더 씌우지 않아도 DataFrame 형태로 반환

    x   y   z
b   3   4   5
d   9  10  11
f  15  16  17

### NaN이 아닌값에 대하여 Boolean 인덱싱

In [42]:
#loc로 조회, data1의 값이 Nan이 아닌 모든 데이터 조회
# .notnull(): .isnull()과 반대의 True, False 값 반환 (결측값 제외)
df.loc[df['data1'].notnull()]

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
c   6   7   8    2.4    NaN
e  12  13  14    1.2    NaN

In [44]:
#loc로 조회, data1의 값이 Nan이 아닌 x,y 컬럼 조회
df.loc[df['data1'].notnull(), ['x', 'y']]

    x   y
a   0   1
c   6   7
e  12  13

### 결측값을 채워주는 fillna

In [45]:
#data1의 NaN값을 0으로 채우기
df['data1'].fillna(value = 0)
# data1의 데이터가 실수형이므로 0도 동일 칼럼의 형태에 맞게 실수형으로 삽입
# 'value =' 생략 가능 (숫자만 입력)

a    1.7
b    0.0
c    2.4
d    0.0
e    1.2
f    0.0
Name: data1, dtype: float64

In [46]:
df # 원본 데이터 유지, 단순 조회

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
b   3   4   5    NaN    NaN
c   6   7   8    2.4    NaN
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

In [47]:
#원본 데이터를 변경하고 싶다면? 
#data1 컬럼에 NaN이 있으면 0 로 채우기
df['data1'].fillna(value = 0, inplace = True)

In [48]:
df

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
b   3   4   5    0.0    NaN
c   6   7   8    2.4    NaN
d   9  10  11    0.0    NaN
e  12  13  14    1.2    NaN
f  15  16  17    0.0    NaN

In [50]:
#DataFrame 내 NaN 데이터를 찾아 value 로 -1로 변환
#복사본생성(df2)

df2 = df.fillna(value = -1) # 원본 데이터 유지, df2에 할당

In [55]:
df2 # numpy의 기본값이 float 형태이므로 -1.0 삽입

    x   y   z  data1  data2
a   0   1   2    1.7   -1.0
b   3   4   5    0.0   -1.0
c   6   7   8    2.4   -1.0
d   9  10  11    0.0   -1.0
e  12  13  14    1.2   -1.0
f  15  16  17    0.0   -1.0

In [52]:
df # 원본 데이터 유지

    x   y   z  data1  data2
a   0   1   2    1.7    NaN
b   3   4   5    0.0    NaN
c   6   7   8    2.4    NaN
d   9  10  11    0.0    NaN
e  12  13  14    1.2    NaN
f  15  16  17    0.0    NaN

In [56]:
#data2컬럼의 NaN을 2로 채우기, df2에 저장
df2['data2'] = df['data2'].fillna(2) # inplace = True 방식 대신 column 할당 방식 사용

In [57]:
df2

    x   y   z  data1  data2
a   0   1   2    1.7    2.0
b   3   4   5    0.0    2.0
c   6   7   8    2.4    2.0
d   9  10  11    0.0    2.0
e  12  13  14    1.2    2.0
f  15  16  17    0.0    2.0

### 빈값(NaN)이 있는 행을 제거

In [58]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(18).reshape(6,3),
                               index=['a','b','c','d','e','f'],
                               columns=['x','y','z'])

df['data1'] = pd.Series([1.7, 1.2, 1.7], index=['a', 'e', 'c'])
df['data2']  = pd.Series([-1, -1, -1], index=['a', 'b', 'c'])
df

    x   y   z  data1  data2
a   0   1   2    1.7   -1.0
b   3   4   5    NaN   -1.0
c   6   7   8    1.7   -1.0
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

In [59]:
df

    x   y   z  data1  data2
a   0   1   2    1.7   -1.0
b   3   4   5    NaN   -1.0
c   6   7   8    1.7   -1.0
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

In [60]:
#Nan행 제거
df.dropna() # 기본값: how = 'any'

   x  y  z  data1  data2
a  0  1  2    1.7   -1.0
c  6  7  8    1.7   -1.0

In [61]:
df # 원본 데이터 유지

    x   y   z  data1  data2
a   0   1   2    1.7   -1.0
b   3   4   5    NaN   -1.0
c   6   7   8    1.7   -1.0
d   9  10  11    NaN    NaN
e  12  13  14    1.2    NaN
f  15  16  17    NaN    NaN

In [62]:
#모든값이 Nan인 g행  추가
df.loc['g'] = np.nan
df

      x     y     z  data1  data2
a   0.0   1.0   2.0    1.7   -1.0
b   3.0   4.0   5.0    NaN   -1.0
c   6.0   7.0   8.0    1.7   -1.0
d   9.0  10.0  11.0    NaN    NaN
e  12.0  13.0  14.0    1.2    NaN
f  15.0  16.0  17.0    NaN    NaN
g   NaN   NaN   NaN    NaN    NaN

In [63]:
#행 데이터의 모든 값이 NaN 인 행 데이터를 제거한다.
df.dropna(how = 'all')

      x     y     z  data1  data2
a   0.0   1.0   2.0    1.7   -1.0
b   3.0   4.0   5.0    NaN   -1.0
c   6.0   7.0   8.0    1.7   -1.0
d   9.0  10.0  11.0    NaN    NaN
e  12.0  13.0  14.0    1.2    NaN
f  15.0  16.0  17.0    NaN    NaN

In [64]:
df # 원본 데이터 유지

      x     y     z  data1  data2
a   0.0   1.0   2.0    1.7   -1.0
b   3.0   4.0   5.0    NaN   -1.0
c   6.0   7.0   8.0    1.7   -1.0
d   9.0  10.0  11.0    NaN    NaN
e  12.0  13.0  14.0    1.2    NaN
f  15.0  16.0  17.0    NaN    NaN
g   NaN   NaN   NaN    NaN    NaN

In [65]:
# 행 데이터 중 하나라도 NaN이면 해당 행만 제거함
df.dropna(how = 'any')

     x    y    z  data1  data2
a  0.0  1.0  2.0    1.7   -1.0
c  6.0  7.0  8.0    1.7   -1.0

In [66]:
#원본데이터를 변경하고 싶다면
df.dropna(how='any',inplace = True)

In [67]:
df

     x    y    z  data1  data2
a  0.0  1.0  2.0    1.7   -1.0
c  6.0  7.0  8.0    1.7   -1.0